/**
  *************************************************************************************************************************
  * @file    led.c
  * @author  amkl
  * @version V1.0
  * @date    2022-09-22
  * @brief   led模块.c文件配置
  *************************************************************************************************************************
  * @attention
  *
  *************************************************************************************************************************
  */

/* Includes -------------------------------------------------------------------------------------------------------------*/
#include "led.h"
/* 定义 -----------------------------------------------------------------------------------------------------------------*/


/**
 * 函数名:LED_GPIO_Config
 * 描述:led模块对应的gpio配置
 * 输入:无
 * 输出:无
 */
void LED_GPIO_Config(void)
{
 GPIO_InitTypeDef  GPIO_InitStructure;
 	
 RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOC, ENABLE);	 //使能PC13端口时钟
	
 GPIO_InitStructure.GPIO_Pin = GPIO_Pin_13;	    		   //PC13 端口配置, 推挽输出
 GPIO_InitStructure.GPIO_Mode = GPIO_Mode_Out_PP; 		 //推挽输出
 GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;		 //IO口速度为50MHz
	
 GPIO_Init(GPIOC, &GPIO_InitStructure);	  				 		//推挽输出 ，IO口速度为50MHz
	
 GPIO_SetBits(GPIOC,GPIO_Pin_13); 						 				//PC13 输出高 					 //PC13 输出高
}

/*****************************************************END OF FILE*********************************************************/	
